{"config": {"name": "sequential_1", "layers": [{"config": {"dilation_rate": [1, 1], "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "batch_input_shape": [null, 64, 64, 3], "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "padding": "valid", "activation": "relu", "kernel_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.1, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 5, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}